app/Controllers/BarangController.php

    public function index()
    {
        $data['barang'] = $this->barang->findAll();
---
SELECT *
FROM `barang`