app/Controllers/BarangMasukController.php

SELECT `barang_masuk`.*, `barang`.`nama_barang`, `user`.`username` AS `username`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id_barang` = `barang_masuk`.`id_barang`
LEFT JOIN `user` ON `user`.`id_user` = `barang_masuk`.`id_user`
ORDER BY `tanggal` DESC
SELECT *
FROM `barang`
---
    public function index()
    {
        $data['masuk'] = $this->barangMasuk
            ->select('barang_masuk.*, barang.nama_barang, user.username AS username')
            ->join('barang', 'barang.id_barang = barang_masuk.id_barang')
             ->join('user', 'user.id_user = barang_masuk.id_user', 'left')
            ->orderBy('tanggal', 'DESC')
            ->findAll();

        $data['barang'] = $this->barang->findAll();