app/Controllers/BarangKeluarController.php

SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`
ORDER BY `tanggal` DESC
---
    public function index()
    {
        $data['keluar'] = $this->barangKeluar
            ->select('barang_keluar.*, barang.nama_barang')
            ->join('barang', 'barang.id_barang = barang_keluar.id_barang')
            ->orderBy('tanggal', 'DESC')
            ->findAll();

SELECT *
FROM `barang`
---
    public function create()
    {
        $data['barang'] = $this->barang->findAll();

INSERT INTO `barang_keluar` (`id_barang`, `id_user`, `jumlah`, `tanggal`, `created_at`, `updated_at`) VALUES ('3', '1', '5', '2025-12-08 11:22:46', '2025-12-08 11:22:46', '2025-12-08 11:22:46')
---
    public function store()
    {
        try {
            $idUser = session()->get('id_user'); // user login

            $this->barangKeluar->insert([
                'id_barang' => $this->request->getPost('id_barang'),
                'id_user'   => $idUser,
                'jumlah'    => $this->request->getPost('jumlah'),
                'tanggal'   => date('Y-m-d H:i:s'),
            ]);