app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `barang_masuk`
WHERE MONTH(tanggal) = '12'
SELECT COUNT(*) AS `numrows`
FROM `barang_keluar`
WHERE MONTH(tanggal) = '12'
SELECT COUNT(*) AS `numrows`
FROM `barang`
WHERE `stok` < 5
SELECT `barang_masuk`.*, `barang`.`nama_barang`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id_barang` = `barang_masuk`.`id_barang`
ORDER BY `tanggal` DESC
 LIMIT 5
SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`
ORDER BY `tanggal` DESC
 LIMIT 5
---
    public function admin()
    {
        $barangModel = new ModelBarang();
        $masukModel  = new ModelBarangMasuk();
        $keluarModel = new ModelBarangKeluar();

        $data = [
            'total_barang' => $barangModel->countAll(),

            'total_masuk' => $masukModel
                ->where("MONTH(tanggal)", date('m'))
                ->countAllResults(),

            'total_keluar' => $keluarModel
                ->where("MONTH(tanggal)", date('m'))
                ->countAllResults(),

            'stok_limit' => $barangModel
                ->where('stok <', 5)
                ->countAllResults(),

            'recent_masuk' => $masukModel
                ->select('barang_masuk.*, barang.nama_barang')
                ->join('barang', 'barang.id_barang = barang_masuk.id_barang')
                ->orderBy('tanggal', 'DESC')
                ->limit(5)
                ->findAll(),

            'recent_keluar' => $keluarModel
                ->select('barang_keluar.*, barang.nama_barang')
                ->join('barang', 'barang.id_barang = barang_keluar.id_barang')
                ->orderBy('tanggal', 'DESC')
                ->limit(5)
                ->findAll()

SELECT COUNT(*) AS `numrows`
FROM `barang_masuk`
WHERE DATE(tanggal) = '2025-12-07'
SELECT COUNT(*) AS `numrows`
FROM `barang_keluar`
WHERE DATE(tanggal) = '2025-12-07'
SELECT `barang_masuk`.*, `barang`.`nama_barang`
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id_barang` = `barang_masuk`.`id_barang`
ORDER BY `tanggal` DESC
 LIMIT 5
SELECT `barang_keluar`.*, `barang`.`nama_barang`
FROM `barang_keluar`
JOIN `barang` ON `barang`.`id_barang` = `barang_keluar`.`id_barang`
ORDER BY `tanggal` DESC
 LIMIT 5
---
public function staf()
{
    $barangModel = new ModelBarang();
    $masukModel  = new ModelBarangMasuk();
    $keluarModel = new ModelBarangKeluar();

    $today = date('Y-m-d');

    $data = [
        'total_barang' => $barangModel->countAll(),

        'masuk_hari_ini' => $masukModel
            ->where("DATE(tanggal) = '$today'", null, false)
            ->countAllResults(),

        'keluar_hari_ini' => $keluarModel
            ->where("DATE(tanggal) = '$today'", null, false)
            ->countAllResults(),

        'recent_masuk' => $masukModel
            ->select('barang_masuk.*, barang.nama_barang')
            ->join('barang', 'barang.id_barang = barang_masuk.id_barang')
            ->orderBy('tanggal', 'DESC')
            ->limit(5)
            ->findAll(),

        'recent_keluar' => $keluarModel
            ->select('barang_keluar.*, barang.nama_barang')
            ->join('barang', 'barang.id_barang = barang_keluar.id_barang')
            ->orderBy('tanggal', 'DESC')
            ->limit(5)
            ->findAll(),