app/Controllers/Laporan.php

SELECT *
FROM `barang`
---
    public function inventory()
    {
        $barangModel = new \App\Models\ModelBarang();
        $data['barang'] = $barangModel->findAll();

SELECT `barang_masuk`.*, `barang`.`nama_barang`, 'masuk' AS jenis
FROM `barang_masuk`
JOIN `barang` ON `barang`.`id_barang` = `barang_masuk`.`id_barang`
WHERE `tanggal` >= '2025-12-05'
AND `tanggal` <= '2025-12-09'
---
    public function inventaris()
    {
        $barangMasuk = new \App\Models\ModelBarangMasuk();
        $barangKeluar = new \App\Models\ModelBarangKeluar();

        $start = $this->request->getGet('start');
        $end   = $this->request->getGet('end');
        $jenis = $this->request->getGet('jenis');

        $data['laporan'] = [];

        if ($start && $end && $jenis) {

            if ($jenis == 'masuk' || $jenis == 'semua') {
                $dataMasuk = $barangMasuk
                    ->select("barang_masuk.*, barang.nama_barang, 'masuk' AS jenis")
                    ->join('barang', 'barang.id_barang = barang_masuk.id_barang')
                    ->where("tanggal >=", $start)
                    ->where("tanggal <=", $end)
                    ->findAll();