app/Controllers/Login.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
public function doLogin()
{
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $user = $this->user->where('username', $username)->first();