app/Controllers/User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $userModel = new UserModel();
        $data['users'] = $userModel->findAll();

SELECT *
FROM `user`
WHERE `user`.`id_user` = '1'
---
    public function profile()
    {
        $userId = session()->get('id_user');
        $userModel = new UserModel();
        $data['user'] = $userModel->find($userId);