app/Models/ModelBarangKeluar.php

SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '3'
---
    protected function cekStokSebelumKeluar(array $data)
    {
        $barangModel = new ModelBarang();

        $idBarang = $data['data']['id_barang'];
        $jumlah = $data['data']['jumlah'];

        $barang = $barangModel->find($idBarang);