app/Models/ModelBarang.php

    public function kurangiStok($idBarang, $jumlah)
    {
        $barang = $this->find($idBarang);

        if ($barang['stok'] < $jumlah) {
            return false;
        }

        $stokBaru = $barang['stok'] - $jumlah;

        return $this->update($idBarang, ['stok' => $stokBaru]);
---
SELECT *
FROM `barang`
WHERE `barang`.`id_barang` = '3'
UPDATE `barang` SET `stok` = 5, `updated_at` = '2025-12-08 11:22:46'
WHERE `barang`.`id_barang` IN ('3')